In [13]:
import pandas as pd
import numpy as np

In [3]:
seri = pd.Series([1,2,3,4])
seri

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.dtype

dtype('int64')

In [6]:
seri.mean()

2.5

In [7]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [8]:
seri.size

4

In [9]:
seri.ndim

1

In [10]:
seri.shape

(4,)

In [11]:
seri.head(2) # ilk iki hane

0    1
1    2
dtype: int64

In [12]:
seri.tail(2) # son iki satır

2    3
3    4
dtype: int64

In [15]:
seri = pd.Series(np.random.randint(3,17, size = 20 ))
seri

0     16
1      5
2     13
3     11
4     15
5      6
6      7
7     11
8     15
9     12
10     5
11    15
12    13
13    10
14     3
15     3
16     7
17    12
18     8
19    14
dtype: int32

In [17]:
seri = pd.Series(np.random.randint(1,10, size = 5))
seri

0    7
1    8
2    1
3    1
4    6
dtype: int32

In [20]:
seri.index = [list("abcde")]
seri

a    7
b    8
c    1
d    1
e    6
dtype: int32

In [21]:
seri["a"]

7

In [22]:
seri["a":"d"]

a    7
b    8
c    1
d    1
dtype: int32

In [25]:
seri1 = pd.Series(np.random.randint(3,100, size = 5))
seri2 = pd.Series(np.random.randint(4,100, size = 5))

In [28]:
seri3 = pd.concat([seri1,seri2],ignore_index = True)
seri3

0    55
1     4
2    22
3    61
4    19
5    84
6     5
7     4
8    41
9    38
dtype: int32

In [29]:
seri.index

MultiIndex([('a',),
            ('b',),
            ('c',),
            ('d',),
            ('e',)],
           )

In [30]:
seri.values

array([7, 8, 1, 1, 6])

In [31]:
list(seri.items())

[(('a',), 7), (('b',), 8), (('c',), 1), (('d',), 1), (('e',), 6)]

In [32]:
"a" in seri

True

In [33]:
8 in seri.values

True

In [34]:
sozluk = {"hello":"Merhaba", "Age":"Yaş", "Computer": "Bilgisyar"}
seri = pd.Series(sozluk)

In [35]:
seri

hello         Merhaba
Age               Yaş
Computer    Bilgisyar
dtype: object

In [36]:
seri.index

Index(['hello', 'Age', 'Computer'], dtype='object')

In [39]:
list(seri.items())

[('hello', 'Merhaba'), ('Age', 'Yaş'), ('Computer', 'Bilgisyar')]

In [45]:
seri = pd.Series(np.arange(1,13,2))
seri

0     1
1     3
2     5
3     7
4     9
5    11
dtype: int32

In [41]:
seri.mean()

5.0

In [42]:
seri.std()

3.1622776601683795

In [43]:
seri.var()

10.0

In [46]:
seri.median()  #

6.0

In [48]:
seri = pd.Series(np.random.randint(3,100, size = 8))

In [49]:
seri

0    73
1    98
2    54
3    46
4    30
5    82
6    17
7    28
dtype: int32

In [50]:
seri.mean()

53.5

In [51]:
seri.median()

50.0

In [54]:
seri.sort_values()

6    17
7    28
4    30
3    46
2    54
0    73
5    82
1    98
dtype: int32

In [57]:
df = pd.DataFrame(np.random.randint(1,100, size = 10),columns=["Değer"])
df

   Değer
0     60
1     82
2     84
3     22
4     26
5     73
6     72
7     51
8     94
9     89

In [59]:
df = pd.DataFrame(np.random.randint(1,100, size = (3,4)))
df

    0   1   2   3
0  17   6  41  19
1  27   5  27  50
2  11  65  65  81

In [63]:
df = pd.DataFrame(np.random.randint(1,100, size =(4,5)),
                  index = ["a","b","c","d"],
                 columns=["deg1","deg2","deg3","deg4","deg5"])

In [64]:
df

   deg1  deg2  deg3  deg4  deg5
a    36    19    60    55    82
b    25    63    48    35     1
c    84    61    54    39    79
d    15    61    99    89    86

In [65]:
type(df)

pandas.core.frame.DataFrame

In [66]:
df.dtypes

deg1    int32
deg2    int32
deg3    int32
deg4    int32
deg5    int32
dtype: object

In [67]:
df.axes

[Index(['a', 'b', 'c', 'd'], dtype='object'),
 Index(['deg1', 'deg2', 'deg3', 'deg4', 'deg5'], dtype='object')]

In [68]:
df.size

20

In [69]:
df.shape

(4, 5)

In [70]:
df.ndim

2

In [71]:
df.values

array([[36, 19, 60, 55, 82],
       [25, 63, 48, 35,  1],
       [84, 61, 54, 39, 79],
       [15, 61, 99, 89, 86]])

In [72]:
df.keys

<bound method NDFrame.keys of    deg1  deg2  deg3  deg4  deg5
a    36    19    60    55    82
b    25    63    48    35     1
c    84    61    54    39    79
d    15    61    99    89    86>

In [73]:
df_list = df.values

In [75]:
df.head(3)

   deg1  deg2  deg3  deg4  deg5
a    36    19    60    55    82
b    25    63    48    35     1
c    84    61    54    39    79

In [76]:
df.tail(2)

   deg1  deg2  deg3  deg4  deg5
c    84    61    54    39    79
d    15    61    99    89    86

In [77]:
s1 = np.random.randint(1,100,size = 5)
s2 = np.random.randint(1,100,size = 5)
s3 = np.random.randint(1,100,size = 5)

In [78]:
number = {"var1":s1, "var2":s2,"var3":s3}

In [81]:
df = pd.DataFrame(number,index = [list("abcde")])
df

   var1  var2  var3
a     4    77    51
b    58    42    51
c     1    84    72
d    12    28     6
e    74    70    24

In [83]:
df

   var1  var2  var3
a     4    77    51
b    58    42    51
c     1    84    72
d    12    28     6
e    74    70    24

In [84]:
df[0:2]

   var1  var2  var3
a     4    77    51
b    58    42    51

In [85]:
df.iloc[0] #seri olarak getirdi

var1     4
var2    77
var3    51
Name: (a,), dtype: int32

In [86]:
df.iloc[[0]]  # dataframe olarak getirdi

   var1  var2  var3
a     4    77    51

In [87]:
df.loc["a"] # index değerine göre getiriyor

   var1  var2  var3
a     4    77    51

In [89]:
df.iloc[[3]]

   var1  var2  var3
d    12    28     6

In [90]:
df.loc[["d"]]

   var1  var2  var3
d    12    28     6

In [92]:
df.iloc[2:4,1:3] # stop değerleri dahil değil

   var2  var3
c    84    72
d    28     6

In [93]:
df.loc["c":"d", "var2":"var3"] # stop indexleri dahil

   var2  var3
c    84    72
d    28     6

In [94]:
df

   var1  var2  var3
a     4    77    51
b    58    42    51
c     1    84    72
d    12    28     6
e    74    70    24

In [95]:
df = pd.DataFrame(np.random.randint(1,100,size = (3,5)),
                 index = ["deg1 deg2 deg3".split()],
                 columns = [list("abcde")])

In [96]:
df

       a   b   c   d   e
deg1  32  56  82  37  48
deg2  27  40   1  71  96
deg3  22  48   7   7  98

In [97]:
df.iloc[1,1]

40

In [98]:
df.iloc[2,2]

7

In [99]:
df.loc["deg2":"deg3","d":"e"]

       d   e
deg2  71  96
deg3   7  98

In [100]:
df

       a   b   c   d   e
deg1  32  56  82  37  48
deg2  27  40   1  71  96
deg3  22  48   7   7  98

In [102]:
df.drop("deg1",axis=0)  # satır siliyor.

       a   b  c   d   e
deg2  27  40  1  71  96
deg3  22  48  7   7  98

In [103]:
df.drop("deg2")  # axis default 0 olduğu için yazmaya gerek yok

       a   b   c   d   e
deg1  32  56  82  37  48
deg3  22  48   7   7  98

In [105]:
df.drop("a",axis= 1)

       b   c   d   e
deg1  56  82  37  48
deg2  40   1  71  96
deg3  48   7   7  98

In [109]:
arr1 = np.random.randint(2,20, size = (3,6))
arr2 = np.random.randint(1,10, size = (3,5))

In [110]:
arr1

array([[ 3, 14, 10, 11, 14, 13],
       [ 5, 17,  7, 16,  2, 12],
       [15, 16, 10,  2, 12,  7]])

In [111]:
arr2

array([[2, 8, 6, 9, 1],
       [9, 3, 5, 6, 9],
       [7, 1, 3, 8, 1]])

In [121]:
arr3 = np.concatenate((arr1,arr2),axis = 1)

In [122]:
arr3

array([[ 3, 14, 10, 11, 14, 13,  2,  8,  6,  9,  1],
       [ 5, 17,  7, 16,  2, 12,  9,  3,  5,  6,  9],
       [15, 16, 10,  2, 12,  7,  7,  1,  3,  8,  1]])

In [126]:
df = pd.DataFrame(arr3, index = ["satır1 satır2 satır3".split()],
                 columns=[list("abcdefghjkl")])
df

         a   b   c   d   e   f  g  h  j  k  l
satır1   3  14  10  11  14  13  2  8  6  9  1
satır2   5  17   7  16   2  12  9  3  5  6  9
satır3  15  16  10   2  12   7  7  1  3  8  1

In [128]:
df.iloc[1,7]

3

In [129]:
df.loc["satır2","d"]

         d
satır2  16

In [130]:
df

         a   b   c   d   e   f  g  h  j  k  l
satır1   3  14  10  11  14  13  2  8  6  9  1
satır2   5  17   7  16   2  12  9  3  5  6  9
satır3  15  16  10   2  12   7  7  1  3  8  1

In [131]:
df.drop("satır1")

         a   b   c   d   e   f  g  h  j  k  l
satır2   5  17   7  16   2  12  9  3  5  6  9
satır3  15  16  10   2  12   7  7  1  3  8  1

In [132]:
df

         a   b   c   d   e   f  g  h  j  k  l
satır1   3  14  10  11  14  13  2  8  6  9  1
satır2   5  17   7  16   2  12  9  3  5  6  9
satır3  15  16  10   2  12   7  7  1  3  8  1

In [151]:
df.loc[:,"b"].sum()

b    47
dtype: int64

In [167]:
df = pd.DataFrame(np.random.randint(1,100,size = (5,4)))

In [172]:
df

    0   1   2   3
0   8  68  76  64
1  90   1  44  86
2  87  61  46  78
3  50  32  80  35
4  82  50  42  50

In [175]:
df1 = pd.DataFrame({"çalışanlar":["ali","veli","mahmut"],
                    "işe_başlama":[2019,2020,2021]})
df2 = pd.DataFrame({"çalışanlar":["ali","veli","mahmut"],
                   "departman": ["ik","it","muhasebe"]})

In [177]:
df3= pd.merge(df1,df2)

In [178]:
df4 = pd.DataFrame({"grup":["Mühendis","It uzman","çaycı"],
                   "çalışanlar":["ali","veli","mahmut"]})

In [179]:
df4

       grup çalışanlar
0  Mühendis        ali
1  It uzman       veli
2     çaycı     mahmut

In [180]:
pd.merge(df3,df4)

  çalışanlar  işe_başlama departman      grup
0        ali         2019        ik  Mühendis
1       veli         2020        it  It uzman
2     mahmut         2021  muhasebe     çaycı